Stupid-Git/Cyclone-Lin/Cyclone_Open_2_4_4/demo/nxp/lpcxpresso_54s018/ftp_client_demo/keil/startup_lpc54s018.s
__Image_Header  DCD     0xFEEDA5A5  ; (0x00, 0x160) Header Marker

        IF :DEF:XIP_IMAGE
            IF :DEF:ADD_CRC
                DCD     2  ; (0x04) Image Type
            ELSE
                DCD     3  ; (0x04) Image Type
            ENDIF
        ELSE
            IF :DEF:ADD_CRC
                DCD     0  ; (0x04) Image Type
            ELSE
                DCD     1  ; (0x04) Image Type
            ENDIF
        ENDIF

        IF :DEF:XIP_IMAGE
                DCD     0x10000000  ; (0x08) Load_address
        ELSE
                DCD     0x00000000  ; (0x08) Load_address
        ENDIF

                DCD     |Load$$LR$$LR_IROM1$$Length|-4  ; (0x0C) load_length, exclude 4 bytes CRC field.
                DCD     0  ; (0x10) CRC value (only applicable to NON Non-secure images).
                DCD     0  ; (0x14) Version (only applicable to DUAL_ENH image type.
                DCD     0  ; (0x18) EMC static memory configuration settings, required for EMC boot

        IF :DEF:IMG_BAUDRATE
                DCD     IMG_BAUDRATE  ; (0x1C) image baudrate
        ELSE
                DCD     0  ; (0x1C) reserved
        ENDIF

                DCD     0  ; (0x20) reserved
                DCD     0xEDDC94BD  ; (0x24) Image_marker
                DCD     0  ; (0x28) reserved
                DCD     0  ; (0x2C) reserved

;SPIFI Descriptor - W25Q128JVFM
                DCD     0x00000000  ; 0xFFFFFFFF to default 1-bit SPI mode DevStrAdr
                DCD     0x001870EF  ; mfgId + extCount
                DCD     0x00000000  ; extid 0-3
                DCD     0x00000000  ; reserved
                DCD     0x1301001D  ; caps
                DCD     0x00000100  ; Blks + RESV1
                DCD     0x00010000  ; blkSize
                DCD     0x00000000  ; reserved
                DCD     0x00000100  ; pageSize + RESV2
                DCD     0x00003F00  ; maxReadSize
                DCD     0x68506850  ; maxClkRate,maxReadRate,maxHSReadRate,maxProgramRate
                DCD     0x04030050  ; maxHSProgramRate,initDeInitFxId,clearStatusFxId,getStatusFxId
                DCD     0x14110D09  ; setStatusFxId,setOptionsFxId,getReadCmdFxId,getWriteCmdFxId

                AREA    |.text|, CODE, READONLY

; Reset Handler
Reset_Handler   PROC
                EXPORT  Reset_Handler               [WEAK]
                IMPORT  SystemInit
                IMPORT  __main

                LDR     r0, =SystemInit
                BLX     r0
                LDR     r0, =__main
                BX      r0
                ENDP

; Dummy Exception Handlers (infinite loops which can be modified)
NMI_Handler     PROC
                EXPORT  NMI_Handler               [WEAK]
                B       .
                ENDP

HardFault_Handler \
                PROC
                EXPORT  HardFault_Handler         [WEAK]
                B       .
                ENDP

MemManage_Handler     PROC
                EXPORT  MemManage_Handler         [WEAK]
                B       .
                ENDP

BusFault_Handler PROC
                EXPORT  BusFault_Handler          [WEAK]
                B       .
                ENDP

UsageFault_Handler PROC
                EXPORT  UsageFault_Handler        [WEAK]
                B       .
                ENDP

SVC_Handler     PROC
                EXPORT  SVC_Handler               [WEAK]
                B       .
                ENDP

DebugMon_Handler PROC
                EXPORT  DebugMon_Handler          [WEAK]
                B       .
                ENDP

PendSV_Handler  PROC
                EXPORT  PendSV_Handler            [WEAK]
                B       .
                ENDP

SysTick_Handler PROC
                EXPORT  SysTick_Handler           [WEAK]
                B       .
                ENDP

WDT_BOD_IRQHandler\
                PROC
                EXPORT     WDT_BOD_IRQHandler        [WEAK]
                LDR        R0, =WDT_BOD_DriverIRQHandler
                BX         R0
                ENDP

DMA0_IRQHandler\
                PROC
                EXPORT     DMA0_IRQHandler        [WEAK]
                LDR        R0, =DMA0_DriverIRQHandler
                BX         R0
                ENDP

GINT0_IRQHandler\
                PROC
                EXPORT     GINT0_IRQHandler        [WEAK]
                LDR        R0, =GINT0_DriverIRQHandler
                BX         R0
                ENDP

GINT1_IRQHandler\
                PROC
                EXPORT     GINT1_IRQHandler        [WEAK]
                LDR        R0, =GINT1_DriverIRQHandler
                BX         R0
                ENDP

PIN_INT0_IRQHandler\
                PROC
                EXPORT     PIN_INT0_IRQHandler        [WEAK]
                LDR        R0, =PIN_INT0_DriverIRQHandler
                BX         R0
                ENDP

PIN_INT1_IRQHandler\
                PROC
                EXPORT     PIN_INT1_IRQHandler        [WEAK]
                LDR        R0, =PIN_INT1_DriverIRQHandler
                BX         R0
                ENDP

PIN_INT2_IRQHandler\
                PROC
                EXPORT     PIN_INT2_IRQHandler        [WEAK]
                LDR        R0, =PIN_INT2_DriverIRQHandler
                BX         R0
                ENDP

PIN_INT3_IRQHandler\
                PROC
                EXPORT     PIN_INT3_IRQHandler        [WEAK]
                LDR        R0, =PIN_INT3_DriverIRQHandler
                BX         R0
                ENDP

UTICK0_IRQHandler\
                PROC
                EXPORT     UTICK0_IRQHandler        [WEAK]
                LDR        R0, =UTICK0_DriverIRQHandler
                BX         R0
                ENDP

MRT0_IRQHandler\
                PROC
                EXPORT     MRT0_IRQHandler        [WEAK]
                LDR        R0, =MRT0_DriverIRQHandler
                BX         R0
                ENDP

CTIMER0_IRQHandler\
                PROC
                EXPORT     CTIMER0_IRQHandler        [WEAK]
                LDR        R0, =CTIMER0_DriverIRQHandler
                BX         R0
                ENDP

